logs_pics/wrkLogsGet.txt
Running 15s test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.106ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.12ms  777.72us  16.53ms   87.02%
    Req/Sec     2.11k   195.62     4.00k    72.53%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.08ms
 75.000%    1.43ms
 90.000%    1.80ms
 99.000%    2.14ms
 99.900%   13.17ms
 99.990%   16.25ms
 99.999%   16.54ms
100.000%   16.54ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.061     0.000000            1         1.00
       0.412     0.100000         1001         1.11
       0.613     0.200000         1999         1.25
       0.799     0.300000         2999         1.43
       0.956     0.400000         3997         1.67
       1.080     0.500000         5001         2.00
       1.135     0.550000         5502         2.22
       1.197     0.600000         5999         2.50
       1.261     0.650000         6502         2.86
       1.334     0.700000         6997         3.33
       1.430     0.750000         7494         4.00
       1.490     0.775000         7745         4.44
       1.552     0.800000         7994         5.00
       1.609     0.825000         8243         5.71
       1.675     0.850000         8493         6.67
       1.732     0.875000         8744         8.00
       1.766     0.887500         8873         8.89
       1.804     0.900000         8992        10.00
       1.838     0.912500         9119        11.43
       1.867     0.925000         9243        13.33
       1.902     0.937500         9370        16.00
       1.922     0.943750         9431        17.78
       1.942     0.950000         9492        20.00
       1.967     0.956250         9555        22.86
       1.994     0.962500         9618        26.67
       2.018     0.968750         9680        32.00
       2.030     0.971875         9711        35.56
       2.042     0.975000         9743        40.00
       2.053     0.978125         9777        45.71
       2.071     0.981250         9807        53.33
       2.095     0.984375         9838        64.00
       2.109     0.985938         9851        71.11
       2.123     0.987500         9872        80.00
       2.133     0.989062         9882        91.43
       2.145     0.990625         9899       106.67
       2.163     0.992188         9913       128.00
       2.177     0.992969         9921       142.22
       2.191     0.993750         9929       160.00
       2.211     0.994531         9940       182.86
       2.223     0.995313         9946       213.33
       2.297     0.996094         9952       256.00
       3.485     0.996484         9956       284.44
       5.131     0.996875         9960       320.00
       6.775     0.997266         9964       365.71
       8.423     0.997656         9968       426.67
      10.039     0.998047         9972       512.00
      10.735     0.998242         9974       568.89
      11.463     0.998437         9976       640.00
      12.167     0.998633         9978       731.43
      12.791     0.998828         9980       853.33
      13.567     0.999023         9982      1024.00
      13.943     0.999121         9983      1137.78
      14.303     0.999219         9984      1280.00
      14.711     0.999316         9985      1462.86
      15.103     0.999414         9986      1706.67
      15.407     0.999512         9987      2048.00
      15.407     0.999561         9987      2275.56
      15.671     0.999609         9988      2560.00
      15.671     0.999658         9988      2925.71
      15.951     0.999707         9989      3413.33
      15.951     0.999756         9989      4096.00
      15.951     0.999780         9989      4551.11
      16.247     0.999805         9990      5120.00
      16.247     0.999829         9990      5851.43
      16.247     0.999854         9990      6826.67
      16.247     0.999878         9990      8192.00
      16.247     0.999890         9990      9102.22
      16.543     0.999902         9991     10240.00
      16.543     1.000000         9991          inf
#[Mean    =        1.119, StdDeviation   =        0.778]
#[Max     =       16.528, Total count    =         9991]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%  206.00us
 75.000%  249.00us
 90.000%  288.00us
 99.000%  382.00us
 99.900%  512.00us
 99.990%  605.00us
 99.999%   15.44ms
100.000%   15.44ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.042     0.000000            1         1.00
       0.122     0.100000         1023         1.11
       0.148     0.200000         2047         1.25
       0.167     0.300000         3032         1.43
       0.186     0.400000         4021         1.67
       0.206     0.500000         5042         2.00
       0.215     0.550000         5555         2.22
       0.224     0.600000         6030         2.50
       0.233     0.650000         6498         2.86
       0.241     0.700000         6995         3.33
       0.249     0.750000         7509         4.00
       0.254     0.775000         7767         4.44
       0.259     0.800000         8017         5.00
       0.264     0.825000         8246         5.71
       0.271     0.850000         8509         6.67
       0.279     0.875000         8766         8.00
       0.283     0.887500         8874         8.89
       0.288     0.900000         8996        10.00
       0.294     0.912500         9134        11.43
       0.300     0.925000         9254        13.33
       0.309     0.937500         9372        16.00
       0.314     0.943750         9440        17.78
       0.319     0.950000         9499        20.00
       0.325     0.956250         9555        22.86
       0.332     0.962500         9620        26.67
       0.341     0.968750         9685        32.00
       0.345     0.971875         9718        35.56
       0.349     0.975000         9743        40.00
       0.354     0.978125         9781        45.71
       0.359     0.981250         9809        53.33
       0.365     0.984375         9837        64.00
       0.369     0.985938         9851        71.11
       0.375     0.987500         9870        80.00
       0.379     0.989062         9882        91.43
       0.384     0.990625         9898       106.67
       0.392     0.992188         9913       128.00
       0.396     0.992969         9921       142.22
       0.407     0.993750         9932       160.00
       0.412     0.994531         9938       182.86
       0.416     0.995313         9945       213.33
       0.424     0.996094         9955       256.00
       0.427     0.996484         9956       284.44
       0.431     0.996875         9962       320.00
       0.434     0.997266         9964       365.71
       0.443     0.997656         9968       426.67
       0.451     0.998047         9972       512.00
       0.454     0.998242         9974       568.89
       0.471     0.998437         9976       640.00
       0.492     0.998633         9978       731.43
       0.501     0.998828         9980       853.33
       0.513     0.999023         9982      1024.00
       0.517     0.999121         9983      1137.78
       0.519     0.999219         9984      1280.00
       0.546     0.999316         9985      1462.86
       0.549     0.999414         9986      1706.67
       0.563     0.999512         9987      2048.00
       0.563     0.999561         9987      2275.56
       0.574     0.999609         9988      2560.00
       0.574     0.999658         9988      2925.71
       0.580     0.999707         9989      3413.33
       0.580     0.999756         9989      4096.00
       0.580     0.999780         9989      4551.11
       0.605     0.999805         9990      5120.00
       0.605     0.999829         9990      5851.43
       0.605     0.999854         9990      6826.67
       0.605     0.999878         9990      8192.00
       0.605     0.999890         9990      9102.22
      15.439     0.999902         9991     10240.00
      15.439     1.000000         9991          inf
#[Mean    =        0.208, StdDeviation   =        0.167]
#[Max     =       15.432, Total count    =         9991]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29999 requests in 15.00s, 1.86MB read
Requests/sec:   1999.96
Transfer/sec:    126.95KB